In [71]:
import pandas as pd
import numpy as np

In [113]:
my = pd.read_csv('index_handle.csv')

In [114]:
my

         index  age
0  Satvik (01)    2
1   Rajat (05)    5
2  Yagyam (07)   23
3    Ramu (06)    5
4   Ishan (04)   13
5    Muku (02)   46
6   Mehul (08)   21
7    Uday (03)   32

In [115]:
my=my.set_index('index')

In [116]:
my

             age
index
Satvik (01)    2
Rajat (05)     5
Yagyam (07)   23
Ramu (06)      5
Ishan (04)    13
Muku (02)     46
Mehul (08)    21
Uday (03)     32

In [117]:
#separrating name from ids
#.str gets each item from list

name_id_split = my.index.str.split('\s\(')

In [120]:
my.index

Index(['Satvik (01)', 'Rajat (05)', 'Yagyam (07)', 'Ramu (06)', 'Ishan (04)',
       'Muku (02)', 'Mehul (08)', 'Uday (03)'],
      dtype='object', name='index')

In [121]:
name_id_split

Index([['Satvik', '01)'],  ['Rajat', '05)'], ['Yagyam', '07)'],
         ['Ramu', '06)'],  ['Ishan', '04)'],   ['Muku', '02)'],
        ['Mehul', '08)'],   ['Uday', '03)']],
      dtype='object', name='index')

In [122]:
#getting name from each sub list
newIndex=name_id_split.str[0]

In [123]:
newIndex

Index(['Satvik', 'Rajat', 'Yagyam', 'Ramu', 'Ishan', 'Muku', 'Mehul', 'Uday'], dtype='object', name='index')

In [124]:
index_with_curlybrace=name_id_split.str[1]

In [125]:
index_with_curlybrace

Index(['01)', '05)', '07)', '06)', '04)', '02)', '08)', '03)'], dtype='object', name='index')

In [126]:
index_withoutbrace=index_with_curlybrace.str[:2]

In [127]:
index_withoutbrace

Index(['01', '05', '07', '06', '04', '02', '08', '03'], dtype='object', name='index')

In [128]:
my['id'] = index_withoutbrace

In [129]:
my

             age  id
index
Satvik (01)    2  01
Rajat (05)     5  05
Yagyam (07)   23  07
Ramu (06)      5  06
Ishan (04)    13  04
Muku (02)     46  02
Mehul (08)    21  08
Uday (03)     32  03

In [130]:
my.index = newIndex

In [133]:
my

        age  id
index
Satvik    2  01
Rajat     5  05
Yagyam   23  07
Ramu      5  06
Ishan    13  04
Muku     46  02
Mehul    21  08
Uday     32  03